// Подключение библиотек
#include <stdio.h>
#include <locale.h>
#include <math.h>
// Создание константы ПИ
#define M_PI            3.14159265358979323846

// Создание основной функции
int main() {
	// Добавление русской локали  
	setlocale(LC_CTYPE, "RUS");
	// Обозначение переменной для градусов
	float gr;

	// Ввод значения градусов
	puts("Введите значение градусов угла, синус которого хотите расчитать");
	scanf("%f", &gr);
	getchar();

	// Перевод градусов в радианы
	float result = gr * M_PI / 180;
	// Рассчет синуса
	float res = sin(result);
	// Вывод результатов
	printf("Угол - %.f, его синус - %f ", gr, res);
}
